Revit 2027 API
AnalysisDisplayStyleVectorTextType Enumeration
 Defines text visualization types for vector settings of analysis display style.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum AnalysisDisplayStyleVectorTextType
Public Enumeration AnalysisDisplayStyleVectorTextType
public enum class AnalysisDisplayStyleVectorTextType
type AnalysisDisplayStyleVectorTextType
Members
Member name | Value | Description
ShowAll | 0 |  Show vector text label for each point
ShowNone | 1 |  Don't show vector text labels
ShowPredefined | 2 |  Show vector text label only for points that have flag ValueAtPointFlags::DisplayText
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace